export function getLayerName(index) {
    // 贴图文件目录
    // 文件名映射规则（根据索引）
    const fileMappings = {
        0: "第四纪顶部砾石含水层",
        1: "隔水层_1",
        2: "第四纪底部砾石含水层",
        3: "隔水层_2",
        4: "石盒子组砂岩含水层",
        5: "隔水层_3",
        6: "大煤顶部砂岩含水层",
        7: "2#煤",
        8: "隔水层_4",
        9: "野青灰岩含水层",
        10: "隔水层_5",
        11: "5#煤",
        12: "隔水层_6",
        13: "伏青灰岩含水层",
        14: "隔水层_7",
        15: "大青灰岩含水层",
        16: "隔水层_8-1",
        17: "9#煤",
        18:"9#煤",
        19: "隔水层_8-2",
        20: "本溪灰岩含水层",
        21: "隔水层_9",
        22: "奥陶系灰岩含水层",
        23: "奥灰顶界面",
      };
  
    // 获取文件名
    const fileName = fileMappings[index];
    if (!fileName) {
      console.error(`索引 ${index} 没有对应的文件映射`);
      return `Layer_${index}`; // 返回 null 表示无效映射
    }else{
        return fileName;
    }
  
  }